Revit 2027 API
AdvancedLossFactor Constructor
 Creates an advanced loss factor object with values set to no loss.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AdvancedLossFactor()
Public Sub New
public:
AdvancedLossFactor()
new : unit -> AdvancedLossFactor
See Also
Reference
AdvancedLossFactor Class
AdvancedLossFactor Overload
Autodesk.Revit.DB.Lighting Namespace